Autodesk.Revit.UI.RevitCommandId.LookupCommandId(System.String)
Looks up and retrieves the Revit command id with the given id string.
name:
he Revit command name. Refer to the entries in the Revit journal to find the string to use for a particular command.
Returns:
The Revit command id. Returning "null" if a command with the given name was not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.UI.RevitCommandId.#ctor(System.String,System.UInt32)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013